---
kind: property
id: P:Autodesk.Revit.DB.Structure.FabricSheet.SketchId
source: html/9ad2ae97-2292-14f2-4d66-085ca70ec371.htm
---
# Autodesk.Revit.DB.Structure.FabricSheet.SketchId Property

The id of the Sketch element for this element.

## Syntax (C#)
```csharp
public ElementId SketchId { get; }
```